       IDENTIFICATION DIVISION.
       PROGRAM-ID. BalanceReport IS INITIAL.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORTEDDATA ASSIGN TO "BalanceReport.tmp"
               ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION USING LEDGERFILE, LEDGERREPORT, RECORDLINE,
               TRANSACTIONLINE, CURRENTDATE, FILTERS.
       0200-BALANCE-MAIN.
           SORT SORTEDDATA ON 

           EXIT PROGRAM.

       0210-SORT-DATA.
               
               
